cask_args appdir: '/Applications'

tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'neovim/neovim'

brew 'ack'
brew 'ant'
brew 'aspcud'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'cabal-install'
brew 'camlp4'
brew 'caskroom/cask/brew-cask'
brew 'chruby'
brew 'clasp'
#brew 'clipper'
brew 'cloc'
brew 'cloog'
brew 'closure-compiler'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'dirmngr'
brew 'elinks'
brew 'emacs', args: ['with-cocoa']
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'fswatch'
brew 'gcc'
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'gettext'
brew 'ghc'
brew 'gifsicle'
brew 'git', args: ['with-pcre']
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnupg2'
brew 'gnutls'
brew 'go'
brew 'gpg-agent'
brew 'gringo'
brew 'htop-osx'
brew 'httping'
brew 'httrack'
brew 'ievms'
brew 'iftop'
brew 'imagemagick'
brew 'isl'
brew 'jpeg'
brew 'json-c'
brew 'lame'
brew 'libassuan'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libmpc'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libusb'
brew 'libusb-compat'
brew 'libvo-aacenc'
brew 'libyaml'
#brew 'libyubikey'
brew 'links'
brew 'macvim'
brew 'makedepend'
brew 'mariadb'
#brew 'mas'
brew 'memcached'
brew 'mldonkey'
brew 'mobile-shell'
brew 'mpfr'
brew 'neovim/neovim/neovim'
brew 'nettle'
brew 'nginx'
brew 'node'
brew 'ocaml'
brew 'openssl'
brew 'optipng'
brew 'ossp-uuid'
brew 'pcre'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'pngquant'
brew 'postgresql'
brew 'potrace'
brew 'protobuf'
brew 'pstree'
brew 'pth'
brew 'pwgen'
brew 'python'
brew 'qemu'
brew 'qt'
brew 'ragel'
brew 'readline'
brew 'redis'
brew 'rhino'
brew 'ruby-install'
brew 's3cmd'
brew 'shellcheck'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux', args: ['HEAD']
brew 'tree'
brew 'unar'
brew 'v8'
brew 'valgrind'
brew 'vim', args: ['HEAD']
brew 'watch'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'xz'
#brew 'ykpers'
brew 'zsh'

cask '1password-beta'
cask 'arq'
cask 'bartender'
cask 'dropbox'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'google-chrome-canary'
cask 'hammerspoon'
cask 'isolator'
cask 'istat-menus'
cask 'iterm2-nightly'
cask 'java'
cask 'karabiner'
cask 'mailmate'
cask 'nvalt'
cask 'omnidisksweeper'
cask 'skype'
cask 'spotify'
cask 'steam'
cask 'superduper'
cask 'tcl'
cask 'textmate'
cask 'transmission'
cask 'tunnelblick'
cask 'vlc'
cask 'xquartz'

#
# mas (Mac App Store)
#
# mas is a neat idea, but in practice worse than just clicking
# around in the app. Several apps fail to install, and others
# are invisible to the search (replaced by newer, paid versions).
#
#mas 'Diagrammix', id: 418534796
#mas 'Fantastical', id: 975937182
#mas 'Kindle', id: 405399194
#mas 'Marked 2', id: 890031187
#mas 'Net Monitor', id: 480482806
# ScreenFlow 4 (not listed) -> (now) ScreenFlow 6
#mas 'Skitch', id: 425955336
#mas 'Textual 5', id: 896450579
#mas 'The Unarchiver', id: 425424353 # Fails
#mas 'Wunderlist', id: 410628904 # Fails
# xScope (not listed) -> (now) xScope 4
