# Based on the output of `brew bundle dump` (which must be run outside of tmux).

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'abook'
brew 'ack'
brew 'ant'
brew 'aspcud'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'cabal-install'
brew 'cairo'
brew 'camlp4'
brew 'chruby'
brew 'clasp'
brew 'clipper', restart_service: true
brew 'cloc'
brew 'cloog'
brew 'closure-compiler'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'dirmngr'
brew 'elinks'
brew 'emacs', args: ['with-cocoa']
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'ghc'
brew 'gifsicle'
brew 'git', args: ['with-pcre']
brew 'glib'
brew 'gmime'
brew 'gmp'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnupg'
brew 'gnupg2'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gpg-agent'
brew 'gringo'
brew 'harfbuzz'
brew 'highlight'
brew 'htop-osx'
brew 'httping'
brew 'httrack'
brew 'hub'
brew 'icu4c'
brew 'ievms'
brew 'iftop'
brew 'imagemagick'
brew 'imapfilter'
brew 'isl'
brew 'isync', args: ['with-berkeley-db']
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'json-c'
brew 'lame'
brew 'less'
brew 'lbdb'
brew 'libassuan'
brew 'libcroco'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libmpc'
brew 'libpng'
brew 'librsvg'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libusb'
brew 'libusb-compat'
brew 'libuv'
brew 'libvo-aacenc'
brew 'libvterm'
brew 'libyaml'
brew 'libyubikey'
brew 'links'
brew 'lockrun'
brew 'lua'
brew 'macvim'
brew 'makedepend'
brew 'mariadb'
brew 'memcached', restart_service: true
brew 'mldonkey'
brew 'mobile-shell'
brew 'mpfr'
brew 'msgpack'
brew 'msmtp'
brew 'mutt'
brew 'neovim'
brew 'nettle'
brew 'nginx'
brew 'node'
brew 'notmuch'
brew 'ocaml'
brew 'ocamlbuild'
brew 'openssl'
brew 'openssl@1.1'
brew 'optipng'
brew 'ossp-uuid'
brew 'pandoc'
brew 'pango'
brew 'par'
brew 'pcre'
brew 'perl'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'pngquant'
brew 'postgresql'
brew 'potrace'
brew 'protobuf'
brew 'pstree'
brew 'pth'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'qemu'
brew 'qt'
brew 'ragel'
brew 'ranger'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'rhino'
brew 'ripgrep'
brew 'ruby-install'
brew 's3cmd'
brew 'shared-mime-info'
brew 'shellcheck'
brew 'sqlite'
brew 'talloc'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux', args: ['HEAD']
brew 'tokyo-cabinet'
brew 'tree'
brew 'unar'
brew 'unibilium'
brew 'urlview'
brew 'utf8proc'
brew 'v8'
brew 'vim'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'xapian'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'ykpers'
brew 'zsh'

cask '1password-beta'
cask 'alfred'
cask 'arq'
cask 'bartender'
cask 'dropbox'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'google-chrome-canary'
cask 'hammerspoon'
cask 'isolator'
cask 'istat-menus'
cask 'iterm2-nightly'
cask 'java'
cask 'karabiner-elements'
cask 'nvalt'
cask 'omnidisksweeper'
cask 'skype'
cask 'spotify'
cask 'steam'
cask 'superduper'
cask 'tcl'
cask 'textmate'
cask 'transmission'
cask 'vlc'
cask 'xquartz'
