tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/brewdler'
tap 'homebrew/versions'
brew 'ack'
brew 'ant'
brew 'autoconf'
brew 'automake'
brew 'brew-cask'
brew 'clipper'
brew 'cloc'
brew 'cloog'
brew 'closure-compiler'
brew 'cmake'
brew 'cscope'
brew 'ctags'
brew 'elinks'
brew 'fontconfig'
brew 'freetype'
brew 'fswatch'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'git', args: ['with-pcre']
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gpg-agent'
brew 'htop-osx'
brew 'iftop'
brew 'imagemagick'
brew 'isl'
brew 'jpeg'
brew 'json-c'
brew 'libassuan'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libmpc'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libyaml'
brew 'libyubikey'
brew 'links'
brew 'macvim'
brew 'makedepend'
brew 'mariadb'
brew 'memcached'
brew 'mercurial'
brew 'mldonkey'
brew 'mobile-shell'
brew 'mpfr'
brew 'nettle'
brew 'nginx'
brew 'node'
brew 'objective-caml'
brew 'openssl'
brew 'optipng'
brew 'ossp-uuid'
brew 'pcre'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'pngquant'
brew 'postgresql'
brew 'protobuf'
brew 'pstree'
brew 'pth'
brew 'pwgen'
brew 'qemu'
brew 'qt'
brew 'ragel'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'rhino'
brew 'ruby-build'
brew 's3cmd'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'v8'
brew 'valgrind', args: ['HEAD']
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'xz'
brew 'ykpers'
brew 'zsh'
cask 'arq'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'isolator'
cask 'istat-menus'
cask 'iterm2-nightly'
cask 'karabiner'
cask 'nvalt'
cask 'omnidisksweeper'
cask 'skype'
cask 'spotify'
cask 'steam'
cask 'superduper'
cask 'textmate'
cask 'vlc'
