# <%= variables.figManaged %>
#
# Based on the output of `brew bundle dump` (which must be run outside of tmux).

cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/homebrew-cask"
tap "homebrew/homebrew-cask-versions"
tap "homebrew/services"
tap "tavianator/tap"

# General packages.
brew "ack"
brew "aspcud"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bdw-gc"
brew "broot"
brew "cairo"
brew "catimg"
brew "chafa"
brew "clasp"
brew "clipper", restart_service: true
brew "cloc"
brew "cloog"
brew "closure-compiler"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "duti"
brew "elinks"
brew "ffmpeg"
brew "findutils"
brew "fontconfig"
brew "freetype"
brew "frum"
brew "fswatch"
brew "gcc"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "gettext"
brew "gifsicle"
brew "git"
brew "git-delta"
#brew "gh"
brew "glib"
brew "glow"
brew "gmime"
brew "gmp"
brew "gnu-sed"
brew "gnupg"
brew "gnupg2"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "grep"
brew "gringo"
brew "harfbuzz"
brew "highlight"
brew "htop"
brew "httping"
brew "httrack"
brew "hub"
brew "icu4c"
brew "ievms"
brew "iftop"
brew "imagemagick"
brew "isl"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "json-c"
brew "lame"
brew "less"
brew "lf"
brew "libassuan"
brew "libcroco"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libksba"
brew "libmpc"
brew "libpng"
brew "librsvg"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libusb"
brew "libusb-compat"
brew "libuv"
brew "libvo-aacenc"
brew "libvterm"
brew "libyaml"
brew "links"
brew "llvm"
brew "lockrun"
brew "lua"
brew "makedepend"
brew "mariadb"
brew "memcached", restart_service: true
brew "mosh"
brew "mpfr"
brew "msgpack"
brew "mtr"
brew "neovim"
brew "nettle"
brew "nginx"
brew "ninja"
brew "ocaml"
brew "ocamlbuild"
brew "openssl"
brew "openssl@1.1"
brew "optipng"
brew "ossp-uuid"
brew "pango"
brew "par"
brew "parallel"
brew "perl"
brew "pinentry"
brew "pixman"
brew "pkg-config"
brew "pngcrush"
brew "pngquant"
brew "postgresql"
brew "potrace"
brew "protobuf"
brew "pstree"
brew "pth"
brew "pwgen"
brew "python"
brew "python3"
brew "qemu"
brew "qt"
brew "ragel"
brew "ranger"
brew "readline"
brew "redis", restart_service: true
brew "rhino"
brew "ripgrep"
brew "rlwrap"
brew "rust"
brew "rust-analyzer"
brew "s3cmd"
brew "shared-mime-info"
brew "sk"
brew "sqlite"
brew "talloc"
brew "tavianator/tap/bfs"
brew "telnet"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tig"
brew "tmux", args: ["HEAD"]
brew "tokyo-cabinet"
brew "tree"
brew "unar"
brew "unibilium"
brew "utf8proc"
brew "v8"
brew "vim"
brew "watch"
brew "watchman"
brew "webp"
brew "wget"
brew "x264"
brew "xapian"
brew "xvid"
brew "xz"
brew "zsh"
<%- if (variables.profile === 'personal') { -%>

# Personal-only packages.
brew "cabal-install" # Not available on ARM yet.
brew "hledger"
brew "gdb" # Not available on ARM yet.
brew "ghc" # Not available on ARM yet.
brew "pandoc" # Not available on ARM yet.
brew "shellcheck" # Not available on ARM yet.
<%- } -%>

<%- if (variables.profile === 'work') { -%>

# Work-only packages.
brew "git-lfs"
<%- } -%>

# General casks.
cask "alfred"
cask "bartender"
cask "blurred"
cask "cleanshot"
cask "1password"
cask "firefox-developer-edition"
cask "google-chrome-canary"
cask "firefox"
cask "google-chrome"
cask "hammerspoon"
cask "hex-fiend"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "omnidisksweeper"
cask "skype"
cask "spotify"
cask "tcl"
cask "vlc"
cask "xquartz"
<%- if (variables.profile === 'personal') { -%>

# Personal-only casks.
cask "arq"
cask "keycastr"
cask "steam"
cask "superduper"
cask "transmission"
<%- } -%>
<%- if (variables.profile === 'work') { -%>

# Work-only casks.
cask "graphiql"
cask "powershell"
cask "raycast"
cask "scroll-reverser"
cask "slack"
cask "utm"
<%- } -%>
