# <%= variables.figManaged %>
#
# Based on the output of `brew bundle dump` (which must be run outside of tmux)
# plus `brew info --json ${formula} | jq '.[].desc'`.

cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
<%- if (variables.profile === 'work') { -%>

# Work-only taps.
tap "withgraphite/tap"
<%- } -%>

# General packages.
brew "ack" # "Search tool like grep, but optimized for programmers"
brew "autoconf" # "Automatic configure script builder"
brew "automake" # "Tool for generating GNU Standards-compliant Makefiles"
brew "bdw-gc" # "Garbage collector for C and C++"
brew "bfs" # "Breadth-first version of find."
brew "broot" # "New way to see and navigate directory trees"
brew "bun" # "Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one."
brew "cabal-install" # "Command-line interface for Cabal and Hackage"
brew "cairo" # "Vector graphics library with cross-device output support"
brew "catimg" # "Insanely fast image printing in your terminal"
brew "chafa" # "Versatile and fast Unicode/ASCII/ANSI graphics renderer"
brew "chroma" # "General purpose syntax highlighter in pure Go"
brew "clang-format" # "Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript"
brew "clasp" # "ASP system to ground and solve logic programs"
brew "clipper", restart_service: true # "Share macOS clipboard with tmux and other local and remote apps"
brew "cloc" # "Statistics utility to count lines of code"
brew "cloog" # "Generate code for scanning Z-polyhedra"
brew "cmake" # "Cross-platform make"
brew "coreutils" # "GNU File, Shell, and Text utilities"
brew "duti" # "Select default apps for documents and URL schemes on macOS"
brew "fd" # "Simple, fast and user-friendly alternative to find"
brew "felinks" # "Text mode browser and Gemini, NNTP, FTP, Gopher, Finger, and BitTorrent client"
brew "ffmpeg" # "Play, record, convert, and stream audio and video"
brew "findutils" # "Collection of GNU find, xargs, and locate"
brew "fontconfig" # "XML-based font configuration API for X Windows"
brew "freetype" # "Software library to render fonts"
brew "fswatch" # "Monitor a directory for changes and run a shell command"
brew "gcc" # "GNU compiler collection"
brew "gd" # "Graphics library to dynamically manipulate images"
brew "gdb" # "GNU debugger" (not available on ARM yet, but gets skipped harmlessly)
brew "gdbm" # "GNU database manager"
brew "gdk-pixbuf" # "Toolkit for image loading and pixel buffer manipulation"
brew "gettext" # "GNU internationalization (i18n) and localization (l10n) library"
brew "ghc" # "Glorious Glasgow Haskell Compilation System"
brew "gifsicle" # "GIF image/animation creator/editor"
brew "git" # "Distributed revision control system"
brew "git-absorb" # "Automatic git commit --fixup"
brew "git-delta" # "Syntax-highlighting pager for git and diff output"
brew "gitui" # "Blazing fast terminal-ui for git written in rust"
brew "glib" # "Core application library for C"
brew "glow" # "Render markdown on the CLI"
brew "gmime" # "MIME mail utilities"
brew "gmp" # "GNU multiple precision arithmetic library"
brew "gnu-sed" # "GNU implementation of the famous stream editor"
brew "gnupg" # "GNU Pretty Good Privacy (PGP) package"
brew "gnutls" # "GNU Transport Layer Security (TLS) Library"
brew "go" # "Open source programming language to build simple/reliable/efficient software"
brew "graphviz" # "Graph visualization software from AT&T and Bell Labs"
brew "grep" # "GNU grep, egrep and fgrep"
brew "gringo" # "ASP system to ground and solve logic programs"
brew "harfbuzz" # "OpenType text shaping engine"
brew "highlight" # "Convert source code to formatted text with syntax highlighting"
brew "htop" # "Improved top (interactive process viewer)"
brew "httping" # "Ping-like tool for HTTP requests"
brew "httrack" # "Website copier/offline browser"
brew "hub" # "Add GitHub support to git on the command-line"
brew "icu4c" # "C/C++ and Java libraries for Unicode and globalization"
brew "iftop" # "Display an interface's bandwidth usage"
brew "imagemagick" # "Tools and libraries to manipulate images in many formats"
brew "isl" # "Integer Set Library for the polyhedral model"
brew "jemalloc" # "Implementation of malloc emphasizing fragmentation avoidance"
brew "jpeg" # "Image manipulation library"
brew "jq" # "Lightweight and flexible command-line JSON processor"
brew "less" # "Pager program similar to more"
brew "libassuan" # "Assuan IPC Library"
brew "libevent" # "Asynchronous event library"
brew "libffi" # "Portable Foreign Function Interface library"
brew "libgcrypt" # "Cryptographic library based on the code from GnuPG"
brew "libgpg-error" # "Common error values for all GnuPG components"
brew "libksba" # "X.509 and CMS library"
brew "libmpc" # "C library for the arithmetic of high precision complex numbers"
brew "libpng" # "Library for manipulating PNG images"
brew "librsvg" # "Library to render SVG files using Cairo"
brew "libtasn1" # "ASN.1 structure parser library"
brew "libtermkey" # "Library for processing keyboard entry from the terminal"
brew "libtiff" # "TIFF library and utilities"
brew "libtool" # "Generic library support script"
brew "libusb" # "Library for USB device access"
brew "libusb-compat" # "Library for USB device access"
brew "libuv" # "Multi-platform support library with a focus on asynchronous I/O"
brew "libvo-aacenc" # "VisualOn AAC encoder library"
brew "libvterm" # "C99 library which implements a VT220 or xterm terminal emulator"
brew "libyaml" # "YAML Parser"
brew "links" # "Lynx-like WWW browser that supports tables, menus, etc."
brew "llvm" # "Next-gen compiler infrastructure"
brew "lockrun" # "Run cron jobs with overrun protection"
brew "lua" # "Powerful, lightweight programming language"
brew "lua-language-server" # "Language Server for the Lua language"
brew "makedepend" # "Creates dependencies in makefiles"
brew "mpfr" # "C library for multiple-precision floating-point computations"
brew "msgpack" # "Library for a binary-based efficient data interchange format"
brew "mtr" # "'traceroute' and 'ping' in a single tool"
brew "neovim" # "Ambitious Vim-fork focused on extensibility and agility"
brew "nettle" # "Low-level cryptographic library"
brew "ninja" # "Small build system for use with gyp or CMake"
brew "ocaml" # "General purpose programming language in the ML family"
brew "ocamlbuild" # "Generic build tool for OCaml"
brew "openssl" # "Cryptography and SSL/TLS Toolkit"
brew "optipng" # "PNG file optimizer"
brew "ossp-uuid" # "ISO-C API and CLI for generating UUIDs"
brew "pandoc" # "Swiss-army knife of markup format conversion"
brew "pango" # "Framework for layout and rendering of i18n text"
brew "par" # "Paragraph reflow for email"
brew "parallel" # "Shell command parallelization utility"
brew "perl" # "Highly capable, feature-rich programming language"
brew "pinentry" # "Passphrase entry dialog utilizing the Assuan protocol"
brew "pixman" # "Low-level library for pixel manipulation"
brew "pkg-config" # "Manage compile and link flags for libraries"
brew "pngcrush" # "Optimizer for PNG files"
brew "pngquant" # "PNG image optimizing utility"
brew "postgresql" # "Object-relational database system"
brew "potrace" # "Convert bitmaps to vector graphics"
brew "protobuf" # "Protocol buffers (Google's data interchange format)"
brew "pstree" # "Show ps output as a tree"
brew "pth" # "GNU Portable THreads"
brew "pwgen" # "Password generator"
brew "python" # "Interpreted, interactive, object-oriented programming language"
brew "python3" # "Interpreted, interactive, object-oriented programming language"
brew "qemu" # "Generic machine emulator and virtualizer"
brew "qt" # "Cross-platform application and UI framework"
brew "readline" # "Library for command-line editing"
brew "redis", restart_service: true # "Persistent key-value database, with built-in net interface"
brew "rhino" # "JavaScript engine"
brew "ripgrep" # "Search tool like grep and The Silver Searcher"
brew "rlwrap" # "Readline wrapper: adds readline support to tools that lack it"
# brew "ruby" # "Powerful, clean, object-oriented scripting language"
brew "rust" # "Safe, concurrent, practical language"
brew "rust-analyzer" # "Experimental Rust compiler front-end for IDEs"
brew "shared-mime-info" # "Database of common MIME types"
brew "shellcheck" # "Static analysis and lint tool, for (ba)sh scripts"
brew "sk" # "Fuzzy Finder in rust!"
brew "sqlite" # "Command-line interface for SQLite"
brew "stylua" # "Opinionated Lua code formatter"
brew "talloc" # "Hierarchical, reference-counted memory pool with destructors"
brew "telnet" # "User interface to the TELNET protocol"
brew "terminal-notifier" # "Send macOS User Notifications from the command-line"
brew "the_silver_searcher" # "Code-search similar to ack"
brew "tig" # "Text interface for Git repositories"
brew "tmux", args: ["HEAD"] # "Terminal multiplexer"
brew "tokyo-cabinet" # "Lightweight database library"
brew "tree" # "Display directories as trees (with optional color/HTML output)"
brew "tree-sitter" # "Parser generator tool and incremental parsing library"
brew "unar" # "Command-line unarchiving tools supporting multiple formats"
brew "unibilium" # "Very basic terminfo library"
brew "utf8proc" # "Clean C library for processing UTF-8 Unicode data"
brew "v8" # "Google's JavaScript engine"
brew "vim" # "Vi 'workalike' with many additional features"
brew "watch" # "Executes a program periodically, showing output fullscreen"
brew "watchman" # "Watch files and take action when they change"
brew "webp" # "Image format providing lossless and lossy compression for web images"
brew "wget" # "Internet file retriever"
brew "x264" # "H.264/AVC encoder"
brew "xapian" # "C++ search engine library"
brew "xvid" # "High-performance, high-quality MPEG-4 video library"
brew "xz" # "General-purpose data compression with high compression ratio"
brew "yazi" # "Blazing fast terminal file manager written in Rust, based on async I/O"
brew "zsh" # "UNIX shell (command interpreter)"
<%- if (variables.profile === 'personal') { -%>

# Personal-only packages.
brew "awscli" # "Official Amazon AWS command-line interface"
brew "hledger" # "Easy plain text accounting with command-line, terminal and web UIs"
brew "memcached", restart_service: true # "High performance, distributed memory object caching system"
brew "nginx" # "HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server"
brew "ragel" # "State machine compiler"
brew "s3cmd" # "Command-line tool for the Amazon S3 service"
<%- } -%>
<%- if (variables.profile === 'work') { -%>

# Work-only packages.
brew "colima" # "Container runtimes on MacOS (and Linux) with minimal setup"
brew "git-lfs" # "Git extension for versioning large files"
brew "graphite" # "Allows you to manage your stacked changes and submit them for review on GitHub"
brew "maven" # "Java-based project management"
<%- } -%>

# General casks.
cask "1password-cli" # "Command-line interface for 1Password"
cask "blurred" # "Utility to dim background/inactive content in the screen"
cask "cleanshot" # "Screen capturing tool"
cask "firefox" # "Web browser"
cask "ghostty" # "Terminal emulator that uses platform-native UI and GPU acceleration"
cask "godspeed" # "Keyboard-focused todo manager"
cask "hammerspoon" # "Desktop automation application"
cask "hex-fiend" # "Hex editor focussing on speed"
cask "istat-menus" # "System monitoring app"
cask "jordanbaird-ice" # "Menu bar manager"
cask "karabiner-elements" # "Keyboard customiser"
cask "keycastr" # "Open-source keystroke visualiser"
cask "kitty" # "GPU-based terminal emulator"
cask "monodraw" # "Tool to create text-based art"
cask "omnidisksweeper" # "Finds large, unwanted files and deletes them"
cask "raycast" # "Control your tools with a few keystrokes"
cask "screenflow" # "Screen recording and video editing software"
cask "spotify" # "Music streaming service"
cask "vlc" # "Multimedia player"
cask "xquartz" # "Open-source version of the X.Org X Window System"
cask "xscope" # "Tools for measuring, inspecting & testing on-screen graphics and layouts"
<%- if (variables.profile === 'personal') { -%>

# Personal-only casks.
cask "1password" # "Password manager that keeps all passwords secure behind one password"
cask "arq" # "Multi-cloud backup application"
cask "diffusionbee" # "Run Stable Diffusion locally"
cask "google-chrome" # "Web browser"
cask "microsoft-edge" # "Multi-platform web browser"
cask "resilio-sync" # "File sync and share software"
cask "signal" # "Instant messaging application focusing on security"
cask "steam" # "Video game digital distribution service"
cask "superduper" # "Backup, recovery and cloning software"
<%- } -%>
<%- if (variables.profile === 'work') { -%>

# Work-only casks.
cask "volta" # "JavaScript toolchain manager for reproducible environments"
cask "zulu" # "OpenJDK distribution from Azul"
<%- } -%>
